{
    "version": "https://jsonfeed.org/version/1",
    "title": "nopcorn",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Decrypting the digital chaos, one byte at a time. A collection of somewhat organized thoughts and deep dives.",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
"items": [
    
        {
            "id": "http://localhost:4000/2023/09/25/duckduckgo-as-c2",
            "title": "Using DuckDuckGo's Image Proxy as a C2 Channel",
            "summary": "DuckDuckGo's image preview APIs put way too much trust in the user and don't validate that the requests came from authentic browsing behavior.",
            "content_text": "      DuckDuckGo’s image proxy doesn’t allow-list trusted URLs, so anyone can request any image through it.    The proxy doesn’t sanitize the URI, allowing for any number of request parameters to be relayed to the server hosting the image.    This can be leveraged by a malicious actor to covertly communicate with a compromised server using an image-based protocol.    Small proof of concept provided: DuckDuckC2  DuckDuckGo (DDG) is a search engine known for its emphasis on user privacy. Unlike many other search engines, it doesn’t track users’ search history, ensuring a more private online search experience. With its user-friendly interface and commitment to not collecting or sharing personal information, it has garnered a dedicated user base among privacy-conscious individuals.Expected BehaviorConducting an image search via DuckDuckGo results in many requests to the external-content subdomain:This endpoint seems to accept a url as parameter u and returns and image. From some of the research I’ve been conducting on image proxies, I know this domain as Bing’s own image proxy (tse.mm.bing.net and tse.explicit.bing.net). It’s not surprising that DuckDuckGo would be leveraging Bing’s services as they source traditional links and images in their search results from the company. Scrolling down through multiple pages of image search always shows the same domains being supplied in the u parameter.I assumed the external-content proxy would only be allow-listing *.bing.net domains and decided it would be interesting to try and confuse the regular expression that was underpinning this function by registering custom domains with bing substrings. Keeping things simple though, I first tested for the presence of the allow-listing by generating a webhook on my testing server and providing it to the proxy…..and it happily tried to pull the image 🤦Probing the APITo my surprise, DuckDuckGo happily accepted the webhook and requested it to receive content. I guess they aren’t allow-listing domains. The request my server received looked like this - curiously, the IP it came from doesn’t appear in DuckDuckGo’s list of DuckDuckBot IPs, despite providing the DuckDuckBot/1.1 user-agent:GET /notanimage HTTP/1.1Host: &lt;MYSERVER&gt;Accept: */*connection: closeaccept-encoding: gzipuser-agent: DuckDuckBot/1.1; (+http://duckduckgo.com/duckduckbot.html)Probing the /iu endpoint a bit more, I discovered that DuckDuckGo returns a HTTP/2 400 error if the content isn’t understood by the proxy (aka it isn’t an image in a valid format - likely based on Content-Type headers). Alternative HTTP verbs like POST and PUT get automatically converted by DuckDuckGo’s servers to a GET for the same endpoint. We know the server software is likely nginx based on the banner, so it’s possible the location block for the /iu endpoint looks something like this:location @force_get {    proxy_method GET;    proxy_pass_request_headers off;    proxy_pass http://ourupstream;}The proxy does pass request parameters to the server hosting the image. I fuzzed the maximum parameter size and it doesn’t seem like DuckDuckGo is performing any filtering on content or length. This means that the only limit is from the web servers and clients doing the proxying. I was able to relay 8192 bytes of data without issue and suspect that number isn’t the ceiling. Additionally, it seems like multiple DuckDuckGo subdomains support the /iu proxy service.Using as a C2 ChannelAssuming we control both sides of proxy connection, we can communicate using request parameters and return output via encoded images using the proper Content-Type headers. While this can be leveraged in many ways, here’s how my proof of concept DuckDuckC2 works:It assumes that server.py is running somewhere where a shell is desired and that client.py needs to communicate with it from reputable IP space (DuckDuckGo). The client can relay tasking for the server via GET parameters and the output the commands are encoded into the image returned as a result. DuckDuckGo happily forwards on the modified image and the client is able to extract the output from it. All of this functionality is wrapped is a pseudo-shell to give the client the impression they are interacting with an actual shell.RemediationWithout internal knowledge of DuckDuckGo’s strategy for image search, it’s difficult to say if this open proxy is a bug or pre-positioning code for integration with future image providers. I would suggest applying an allow-list of domains to the API underpinning this feature - likely something like *.bing.net would suffice as it seems all legitimate use of the proxy simply points to Bing. DuckDuckGo does have many other products though, so it’s possible there are other uses in other codebases.Defending against the use of this technique in a network isn’t too difficult seeing as most web servers will log request parameters. Regardless of the directionality (whether the client or server is in your network), attackers will have to go to great lengths to obfuscate commands and responses from network-aware security solutions.",
            "content_html": "<blockquote>  <ul>    <li>DuckDuckGo’s image proxy doesn’t allow-list trusted URLs, so anyone can request any image through it.</li>    <li>The proxy doesn’t sanitize the URI, allowing for any number of request parameters to be relayed to the server hosting the image.</li>    <li>This can be leveraged by a malicious actor to covertly communicate with a compromised server using an image-based protocol.</li>    <li>Small proof of concept provided: <a href=\"https://github.com/nopcorn/DuckDuckC2\">DuckDuckC2</a></li>  </ul></blockquote><p><a href=\"https://duckduckgo.com\">DuckDuckGo</a> (DDG) is a search engine known for its emphasis on user privacy. Unlike many other search engines, it doesn’t track users’ search history, ensuring a more private online search experience. With its user-friendly interface and commitment to not collecting or sharing personal information, it has garnered a dedicated user base among privacy-conscious individuals.</p><h1 id=\"expected-behavior\">Expected Behavior</h1><p>Conducting an image search via DuckDuckGo results in many requests to the <code>external-content</code> subdomain:</p><p><img src=\"/assets/img/ddg-image-search-network-loads.png\" alt=\"\" /></p><p>This endpoint seems to accept a url as parameter <code>u</code> and returns and image. From some of the research I’ve been conducting on image proxies, I know this domain as Bing’s own image proxy (<code>tse.mm.bing.net</code> and <code>tse.explicit.bing.net</code>). It’s not surprising that DuckDuckGo would be leveraging Bing’s services as they <a href=\"https://duckduckgo.com/duckduckgo-help-pages/results/sources/\">source traditional links and images in their search results from the company</a>. Scrolling down through multiple pages of image search always shows the same domains being supplied in the <code>u</code> parameter.</p><p>I assumed the <code>external-content</code> proxy would only be allow-listing <code>*.bing.net</code> domains and decided it would be interesting to try and confuse the regular expression that was underpinning this function by registering custom domains with <code>bing</code> substrings. Keeping things simple though, I first tested for the presence of the allow-listing by generating a webhook on my testing server and providing it to the proxy…</p><p>..and it happily tried to pull the image 🤦</p><h1 id=\"probing-the-api\">Probing the API</h1><p>To my surprise, DuckDuckGo happily accepted the webhook and requested it to receive content. I guess they aren’t allow-listing domains. The request my server received looked like this - curiously, the IP it came from doesn’t appear in <a href=\"https://duckduckgo.com/duckduckgo-help-pages/results/duckduckbot/\">DuckDuckGo’s list of DuckDuckBot IPs</a>, despite providing the <code>DuckDuckBot/1.1</code> user-agent:</p><pre><code>GET /notanimage HTTP/1.1Host: &lt;MYSERVER&gt;Accept: */*connection: closeaccept-encoding: gzipuser-agent: DuckDuckBot/1.1; (+http://duckduckgo.com/duckduckbot.html)</code></pre><p>Probing the <code>/iu</code> endpoint a bit more, I discovered that DuckDuckGo returns a <code>HTTP/2 400</code> error if the content isn’t understood by the proxy (aka it isn’t an image in a valid format - likely based on <code>Content-Type</code> headers). Alternative HTTP verbs like <code>POST</code> and <code>PUT</code> get automatically converted by DuckDuckGo’s servers to a <code>GET</code> for the same endpoint. We know the server software is likely <code>nginx</code> based on the banner, so it’s possible the location block for the <code>/iu</code> endpoint looks something like this:</p><pre><code>location @force_get {    proxy_method GET;    proxy_pass_request_headers off;    proxy_pass http://ourupstream;}</code></pre><p>The proxy <em>does</em> pass request parameters to the server hosting the image. I fuzzed the maximum parameter size and it doesn’t seem like DuckDuckGo is performing any filtering on content or length. This means that the only limit is from the web servers and clients doing the proxying. I was able to relay 8192 bytes of data without issue and suspect that number isn’t the ceiling. Additionally, it seems like multiple DuckDuckGo subdomains support the <code>/iu</code> proxy service.</p><h1 id=\"using-as-a-c2-channel\">Using as a C2 Channel</h1><p>Assuming we control both sides of proxy connection, we can communicate using request parameters and return output via encoded images using the proper <code>Content-Type</code> headers. While this can be leveraged in many ways, here’s how my proof of concept <a href=\"https://github.com/nopcorn/DuckDuckC2\">DuckDuckC2</a> works:</p><p><img src=\"/assets/img/duckduckc2-flow.png\" alt=\"\" /></p><p>It assumes that <code>server.py</code> is running somewhere where a shell is desired and that <code>client.py</code> needs to communicate with it from reputable IP space (DuckDuckGo). The client can relay tasking for the server via GET parameters and the output the commands are encoded into the image returned as a result. DuckDuckGo happily forwards on the modified image and the client is able to extract the output from it. All of this functionality is wrapped is a pseudo-shell to give the client the impression they are interacting with an actual shell.</p><h1 id=\"remediation\">Remediation</h1><p>Without internal knowledge of DuckDuckGo’s strategy for image search, it’s difficult to say if this open proxy is a bug or pre-positioning code for integration with future image providers. I would suggest applying an allow-list of domains to the API underpinning this feature - likely something like <code>*.bing.net</code> would suffice as it seems all legitimate use of the proxy simply points to Bing. DuckDuckGo does have many other products though, so it’s possible there are other uses in other codebases.</p><p>Defending against the use of this technique in a network isn’t too difficult seeing as most web servers will log request parameters. Regardless of the directionality (whether the client or server is in your network), attackers will have to go to great lengths to obfuscate commands and responses from network-aware security solutions.</p>",
            "url": "http://localhost:4000/2023/09/25/duckduckgo-as-c2",
            
            
            
            "tags": ["infrastructure","c2","proxy"],
            
            "date_published": "2023-09-25T00:00:00-04:00",
            "date_modified": "2023-09-25T00:00:00-04:00",
            
                "author": "nopcorn"
            
        }
    
    ]
}